betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_dmc.h
/**
  *
  * @file    apm32f4xx_ddl_dmc.h
  * @brief   Header file of DMC DDL module.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2016 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef APM32F4xx_DDL_DMC_H
#define APM32F4xx_DDL_DMC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal_def.h"

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @addtogroup DMC_DDL
  * @{
  */

/** @addtogroup DMC_DDL_Private_Macros
  * @{
  */

#if defined(DMC)

#define DMC_TIMEOUT_VALUE                    100U

#define IS_DMC_SDRAM_DEVICE(__INSTANCE__)    ((__INSTANCE__) == DMC_SDRAM_DEVICE)

#define IS_DMC_BANK_WIDTH(__WIDTH__)         (((__WIDTH__) == DMC_SDRAM_BANK_WIDTH_BITS_NUM_1)  || \
                                              ((__WIDTH__) == DMC_SDRAM_BANK_WIDTH_BITS_NUM_2))

#define IS_DMC_COLUMNBITS_NUMBER(__COLUMN__) (((__COLUMN__) == DMC_SDRAM_COLUMN_BITS_NUM_8)  || \
                                              ((__COLUMN__) == DMC_SDRAM_COLUMN_BITS_NUM_9)  || \
                                              ((__COLUMN__) == DMC_SDRAM_COLUMN_BITS_NUM_10) || \
                                              ((__COLUMN__) == DMC_SDRAM_COLUMN_BITS_NUM_11) || \
                                              ((__COLUMN__) == DMC_SDRAM_COLUMN_BITS_NUM_12) || \
                                              ((__COLUMN__) == DMC_SDRAM_COLUMN_BITS_NUM_13) || \
                                              ((__COLUMN__) == DMC_SDRAM_COLUMN_BITS_NUM_14) || \
                                              ((__COLUMN__) == DMC_SDRAM_COLUMN_BITS_NUM_15))

#define IS_DMC_ROWBITS_NUMBER(__ROW__)       (((__ROW__) == DMC_SDRAM_ROW_BITS_NUM_11) || \
                                              ((__ROW__) == DMC_SDRAM_ROW_BITS_NUM_12) || \
                                              ((__ROW__) == DMC_SDRAM_ROW_BITS_NUM_13) || \
                                              ((__ROW__) == DMC_SDRAM_ROW_BITS_NUM_14) || \
                                              ((__ROW__) == DMC_SDRAM_ROW_BITS_NUM_15) || \
                                              ((__ROW__) == DMC_SDRAM_ROW_BITS_NUM_16))
#if defined (APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define IS_DMC_MEMORY_WIDTH(__WIDTH__)        (((__WIDTH__) == DMC_SDRAM_MEM_BUS_WIDTH_8)  || \
                                               ((__WIDTH__) == DMC_SDRAM_MEM_BUS_WIDTH_16))
#else
#define IS_DMC_MEMORY_WIDTH(__WIDTH__)        (((__WIDTH__) == DMC_SDRAM_MEM_BUS_WIDTH_16))
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */

#define IS_DMC_CLK_PHASE(__PHASE__)          (((__PHASE__) == DMC_SDRAM_CLK_PHASE_NORMAL)  || \
                                              ((__PHASE__) == DMC_SDRAM_CLK_PHASE_REVERSE))

#define IS_DMC_RD_DELAY(__STATUS__)          (((__STATUS__) == DMC_SDRAM_RD_DELAY_ENABLE)  || \
                                              ((__STATUS__) == DMC_SDRAM_RD_DELAY_DISABLE))

#if defined (APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define IS_DMC_RD_DELAY_CLK(__VALUE__)       (((__VALUE__) >= 1U) && ((__VALUE__) <= 32U))
#else
#define IS_DMC_RD_DELAY_CLK(__VALUE__)         ((__VALUE__) <= 7U)
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */

#define IS_DMC_WRITE_PIPE(__STATUS__)         (((__STATUS__) == DMC_SDRAM_WRITE_PIPE_ENABLE)  || \
                                              ((__STATUS__) == DMC_SDRAM_WRITE_PIPE_DISABLE))

#define IS_DMC_ACCELERATE_MODE(__STATUS__)    (((__STATUS__) == DMC_SDRAM_ACCELERATE_MODE_ENABLE)  || \
                                              ((__STATUS__) == DMC_SDRAM_ACCELERATE_MODE_DISABLE))

#define IS_DMC_WRAP_BURST(__INC__)           (((__INC__) == DMC_SDRAM_WRAP_BURST_INC4)  || \
                                              ((__INC__) == DMC_SDRAM_WRAP_BURST_INC8))

#define IS_DMC_CAS_LATENCY(__LATENCY__)      (((__LATENCY__) == DMC_SDRAM_CAS_LATENCY_1) || \
                                              ((__LATENCY__) == DMC_SDRAM_CAS_LATENCY_2) || \
                                              ((__LATENCY__) == DMC_SDRAM_CAS_LATENCY_3) || \
                                              ((__LATENCY__) == DMC_SDRAM_CAS_LATENCY_4) || \
                                              ((__LATENCY__) == DMC_SDRAM_CAS_LATENCY_5) || \
                                              ((__LATENCY__) == DMC_SDRAM_CAS_LATENCY_6) || \
                                              ((__LATENCY__) == DMC_SDRAM_CAS_LATENCY_7) || \
                                              ((__LATENCY__) == DMC_SDRAM_CAS_LATENCY_8))

