betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_dmc.h
#define IS_DMC_RAS_TIME(__TIME__)            (((__TIME__) > 0U) && ((__TIME__) <= 16U))
#define IS_DMC_RAS_TO_CAS_DELAY(__DELAY__)    (((__DELAY__) > 0U) && ((__DELAY__) <= 8U))
#define IS_DMC_PRECHARGE_PERIOD(__PERIOD__)   (((__PERIOD__) > 0U) && ((__PERIOD__) <= 8U))
#define IS_DMC_AUTO_REFRESH_TIME(__TIME__)    (((__TIME__) > 0U) && ((__TIME__) <= 16U))
#define IS_DMC_WRITE_RECOVERY_TIME(__TIME__)  (((__TIME__) > 0U) && ((__TIME__) <= 4U))
#define IS_DMC_XSR_TIME(__TIME__)             ((__TIME__) <= 0x1FFU)
#define IS_DMC_ACTIVE_COMMAND_TIME(__TIME__)  (((__TIME__) > 0U) && ((__TIME__) <= 16U))
#define IS_DMC_REFRESH_PERIOD(__PERIOD__)     ((__PERIOD__) <= 0xFFFFU)
#define IS_DMC_STABLE_TIME(__TIME__)          ((__TIME__) <= 0xFFFFU)

#define IS_DMC_POWER_DOWN_MODE(__MODE__)     (((__MODE__) == DMC_SDRAM_POWER_DOWN_ENABLE)  || \
                                              ((__MODE__) == DMC_SDRAM_POWER_DOWN_DISABLE))

#define IS_DMC_SELF_REFRESH_MODE(__MODE__)   (((__MODE__) == DMC_SDRAM_SELF_REFRESH_ENABLE)  || \
                                              ((__MODE__) == DMC_SDRAM_SELF_REFRESH_DISABLE))

#define IS_DMC_REFRESH_TYPE(__TYPE__)        (((__TYPE__) == DMC_SDRAM_REFRESH_TYPE_ROW_ONE)  || \
                                              ((__TYPE__) == DMC_SDRAM_REFRESH_TYPE_ROW_ALL))

#define IS_DMC_PRECHARGE_MODE(__MODE__)      (((__MODE__) == DMC_SDRAM_PRECHARGE_MODE_IM)  || \
                                              ((__MODE__) == DMC_SDRAM_PRECHARGE_MODE_DELAY))

#define IS_DMC_REG_INSERT_NUMBER(__NUMBER__)  ((__NUMBER__) <= 0x7U)

#define IS_DMC_OPEN_BANK_NUMBER(__NUMBER__)     (((__NUMBER__) > 0U) && ((__NUMBER__) <= 16U))

#endif /* DMC */

/**
  * @}
  */

/* Exported typedef ----------------------------------------------------------*/

/** @defgroup DMC_DDL_Exported_typedef DMC Low Layer Exported Types
  * @{
  */

#if defined(DMC)
#define DMC_SDRAM_TypeDef              DMC_TypeDef
#endif /* DMC */

#if defined(DMC)
#define DMC_SDRAM_DEVICE               DMC
#endif /* DMC */

#if defined(DMC)
/**
  * @brief  DMC SDRAM Configuration Structure definition
  */
typedef struct
{
  uint32_t BankWidth;                   /*!< Defines the number of bits of bank width.
                                             This parameter can be a value of @ref DMC_SDRAM_Bank_Width_Bits_number. */

  uint32_t ColumnBitsNumber;            /*!< Defines the number of bits of column address.
                                             This parameter can be a value of @ref DMC_SDRAM_Column_Bits_number. */

  uint32_t RowBitsNumber;               /*!< Defines the number of bits of column address.
                                             This parameter can be a value of @ref DMC_SDRAM_Row_Bits_number.    */

  uint32_t MemoryDataWidth;             /*!< Defines the memory device width.
                                             This parameter can be a value of @ref DMC_SDRAM_Memory_Bus_Width.   */

  uint32_t ClockPhase;                  /*!< Defines the clock phase.
                                             This parameter can be a value of @ref DMC_SDRAM_Clock_Phase.   */

  uint32_t RDDelay;                     /*!< Defines the RD delay enable status.
                                             This parameter can be a value of @ref DMC_SDRAM_RD_Delay_Enable.   */

  uint32_t RDDelayClk;                  /*!< Defines the RD delay clock.
                                             This parameter can be a value between Min_Data = 0 and Max_Data = 7
                                             This parameter can be a value between Min_Data = 1 and Max_Data = 32, only for APM32F423xx, APM32F425xx and APM32F427xx devices. */

  uint32_t WritePipe;                   /*!< Defines the Write pipe enable status.
                                             This parameter can be a value of @ref DMC_SDRAM_Write_Pipe_Enable.   */

  uint32_t AccelerateMode;              /*!< Defines the DMC accelerate mode.
                                             This parameter can be a value of @ref DMC_SDRAM_Accelerate_Mode.   */

  uint32_t WRAPBurstType;               /*!< Defines the DMC WRAP burst type.
                                             This parameter can be a value of @ref DMC_SDRAM_WRAP_Burst_Type.   */

  uint32_t SelfRefreshMode;             /*!< Defines the DMC Self refresh mode.
                                             This parameter can be a value of @ref DMC_SDRAM_Self_Refresh_Mode.   */

  uint32_t PowerDownMode;               /*!< Defines the DMC Power down mode.
                                             This parameter can be a value of @ref DMC_SDRAM_Power_Down_Mode.   */

  uint32_t RefreshTypeEnterSelfRefresh; /*!< Defines the DMC refresh type before entering self-refresh mode.
                                             This parameter can be a value of @ref DMC_SDRAM_Refresh_Type.   */

  uint32_t RefreshTypeExitSelfRefresh;  /*!< Defines the DMC refresh type after exit self-refresh mode.
                                             This parameter can be a value of @ref DMC_SDRAM_Refresh_Type.   */

  uint32_t RegisterInsertNumber;        /*!< Defines the number of registers inserted in read data path.
                                             This parameter can be a value between Min_Data = 0 and Max_Data = 7  */

  uint32_t OpenBankNumber;              /*!< Defines the number of open banks.
                                             This parameter can be a value between Min_Data = 1 and Max_Data = 16  */
} DMC_SDRAM_InitTypeDef;

/**
  * @brief DMC SDRAM Timing parameters structure definition
  */
typedef struct
{
  uint32_t CASLatency;                  /*!< Defines the SDRAM CAS latency in number of memory clock cycles.
                                             This parameter can be a value of @ref DMC_SDRAM_CAS_Latency.        */

  uint32_t RASTime;                     /*!< Defines the minimum RAS time in number of memory clock cycles.
                                              This parameter can be a value between Min_Data = 1 and Max_Data = 16  */

