betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_dmc.h
  uint32_t RASToCASDelay;               /*!< Defines the delay between RAS and CAS in number of memory clock cycles.
                                              This parameter can be a value between Min_Data = 1 and Max_Data = 8  */

  uint32_t PrechargeMode;               /*!< Defines the SDRAM Precharge mode.
                                             This parameter can be a value of @ref DMC_SDRAM_Precharge_Mode.        */

  uint32_t PrechargePeriod;             /*!< Defines the period for precharge.
                                              This parameter can be a value between Min_Data = 1 and Max_Data = 8  */

  uint32_t AutoRefreshTime;              /*!< Defines the Auto Refresh period in number of memory clock cycles.
                                              This parameter can be a value between Min_Data = 1 and Max_Data = 16  */

  uint32_t AutoRefreshNumber;            /*!< Defines the Auto Refresh number.
                                              This parameter can be a value between Min_Data = 1 and Max_Data = 16  */

  uint32_t WriteRecoveryTime;            /*!< Defines the Write recovery Time in number of memory clock cycles.
                                              This parameter can be a value between Min_Data = 1 and Max_Data = 4  */

  uint32_t XSRTime;                      /*!< Defines the delay between a Active Command and time of exit self refresh
                                              in number of memory clock cycles.
                                              This parameter can be a value between Min_Data = 0x000 and Max_Data = 0x1FF  */

  uint32_t ActiveCommandPeriod;          /*!< Defines the period for active command.
                                              This parameter can be a value between Min_Data = 1 and Max_Data = 16  */

  uint32_t RefreshPeriod;                /*!< Defines the period between two continuous refresh in number of memory clock
                                              cycles.
                                              This parameter can be a value between Min_Data = 0x0000 and Max_Data = 0xFFFF  */

  uint32_t StableTime;                   /*!< Defines the stable time in number of memory clock cycles.
                                              This parameter can be a value between Min_Data = 0x0000 and Max_Data = 0xFFFF  */
} DMC_SDRAM_TimingTypeDef;

#endif /* DMC */
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @addtogroup DMC_DDL_Exported_Constants DMC Low Layer Exported Constants
  * @{
  */

#if defined(DMC)
/** @defgroup DMC_DDL_SDRAM_Controller DMC SDRAM Controller
  * @{
  */

/** @defgroup DMC_SDRAM_Bank_Width_Bits_number DMC SDRAM Bank Width Bits number
  * @{
  */
#define DMC_SDRAM_BANK_WIDTH_BITS_NUM_1         (0x00UL << DMC_CFG_BAWCFG_Pos)
#define DMC_SDRAM_BANK_WIDTH_BITS_NUM_2         (0x01UL << DMC_CFG_BAWCFG_Pos)


/** @defgroup DMC_SDRAM_Row_Bits_number DMC SDRAM Row Bits number
  * @{
  */
#define DMC_SDRAM_ROW_BITS_NUM_11               (0x0AUL << DMC_CFG_RAWCFG_Pos)
#define DMC_SDRAM_ROW_BITS_NUM_12               (0x0BUL << DMC_CFG_RAWCFG_Pos)
#define DMC_SDRAM_ROW_BITS_NUM_13               (0x0CUL << DMC_CFG_RAWCFG_Pos)
#define DMC_SDRAM_ROW_BITS_NUM_14               (0x0DUL << DMC_CFG_RAWCFG_Pos)
#define DMC_SDRAM_ROW_BITS_NUM_15               (0x0EUL << DMC_CFG_RAWCFG_Pos)
#define DMC_SDRAM_ROW_BITS_NUM_16               (0x0FUL << DMC_CFG_RAWCFG_Pos)
/**
  * @}
  */

/** @defgroup DMC_SDRAM_Column_Bits_number DMC SDRAM Column Bits number
  * @{
  */
#define DMC_SDRAM_COLUMN_BITS_NUM_8             (0x07UL << DMC_CFG_CAWCFG_Pos)
#define DMC_SDRAM_COLUMN_BITS_NUM_9             (0x08UL << DMC_CFG_CAWCFG_Pos)
#define DMC_SDRAM_COLUMN_BITS_NUM_10            (0x09UL << DMC_CFG_CAWCFG_Pos)
#define DMC_SDRAM_COLUMN_BITS_NUM_11            (0x0AUL << DMC_CFG_CAWCFG_Pos)
#define DMC_SDRAM_COLUMN_BITS_NUM_12            (0x0BUL << DMC_CFG_CAWCFG_Pos)
#define DMC_SDRAM_COLUMN_BITS_NUM_13            (0x0CUL << DMC_CFG_CAWCFG_Pos)
#define DMC_SDRAM_COLUMN_BITS_NUM_14            (0x0DUL << DMC_CFG_CAWCFG_Pos)
#define DMC_SDRAM_COLUMN_BITS_NUM_15            (0x0EUL << DMC_CFG_CAWCFG_Pos)
/**
  * @}
  */

/** @defgroup DMC_SDRAM_Memory_Bus_Width DMC SDRAM Memory Bus Width
  * @{
  */
#if defined (APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define DMC_SDRAM_MEM_BUS_WIDTH_8               (0x00UL << DMC_CFG_DWCFG_Pos)
#define DMC_SDRAM_MEM_BUS_WIDTH_16              (0x01UL << DMC_CFG_DWCFG_Pos)
#else
#define DMC_SDRAM_MEM_BUS_WIDTH_16              (0x00UL << DMC_CFG_DWCFG_Pos)
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup DMC_SDRAM_Clock_Phase DMC SDRAM Clock Phase
  * @{
  */
#define DMC_SDRAM_CLK_PHASE_NORMAL              (0x00000000U)
#define DMC_SDRAM_CLK_PHASE_REVERSE             (0x00000001U)
/**
  * @}
  */

/** @defgroup DMC_SDRAM_RD_Delay_Enable DMC SDRAM RD Delay Enable
  * @{
  */
#define DMC_SDRAM_RD_DELAY_ENABLE              (0x00000000U)
#define DMC_SDRAM_RD_DELAY_DISABLE             (0x00000002U)
/**
  * @}
  */

/** @defgroup DMC_SDRAM_Write_Pipe_Enable DMC SDRAM Write Pipe Enable
  * @{
  */
#define DMC_SDRAM_WRITE_PIPE_ENABLE             (0x00000020U)
#define DMC_SDRAM_WRITE_PIPE_DISABLE            (0x00000000U)
/**
  * @}
  */

/** @defgroup DMC_SDRAM_Accelerate_Mode DMC SDRAM Accelerate Mode
  * @{
  */
#define DMC_SDRAM_ACCELERATE_MODE_ENABLE        (0x00000040U)
#define DMC_SDRAM_ACCELERATE_MODE_DISABLE       (0x00000000U)
/**
  * @}
  */

/** @defgroup DMC_SDRAM_WRAP_Burst_Type DMC SDRAM WRAP Burst Type
  * @{
  */
#define DMC_SDRAM_WRAP_BURST_INC4               (0x00000000U)
#define DMC_SDRAM_WRAP_BURST_INC8               (0x00000080U)
/**
  * @}
  */

/** @defgroup DMC_SDRAM_CAS_Latency DMC SDRAM CAS Latency
  * @{
  */
#define DMC_SDRAM_CAS_LATENCY_1                 (0x00000000U)
#define DMC_SDRAM_CAS_LATENCY_2                 (0x00000001U)
#define DMC_SDRAM_CAS_LATENCY_3                 (0x00000002U)
#define DMC_SDRAM_CAS_LATENCY_4                 (0x00000003U)
#define DMC_SDRAM_CAS_LATENCY_5                 (0x00000004U)
#define DMC_SDRAM_CAS_LATENCY_6                 (0x00000005U)
#define DMC_SDRAM_CAS_LATENCY_7                 (0x00000006U)
#define DMC_SDRAM_CAS_LATENCY_8                 (0x00000007U)
/**
  * @}
  */

