betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_dmc.h
/** @defgroup DMC_SDRAM_Precharge_Mode DMC SDRAM Precharge Mode
  * @{
  */
#define DMC_SDRAM_PRECHARGE_MODE_IM             (0x00000000U)
#define DMC_SDRAM_PRECHARGE_MODE_DELAY          (0x00000008U)
/**
  * @}
  */

/** @defgroup DMC_SDRAM_Self_Refresh_Mode DMC SDRAM Self Refresh Mode
  * @{
  */
#define DMC_SDRAM_SELF_REFRESH_ENABLE           (0x00000002U)
#define DMC_SDRAM_SELF_REFRESH_DISABLE          (0x00000000U)
/**
  * @}
  */

/** @defgroup DMC_SDRAM_Power_Down_Mode DMC SDRAM Power Down Mode
  * @{
  */
#define DMC_SDRAM_POWER_DOWN_ENABLE             (0x00000004U)
#define DMC_SDRAM_POWER_DOWN_DISABLE            (0x00000000U)
/**
  * @}
  */

/** @defgroup DMC_SDRAM_Refresh_Type DMC SDRAM Refresh Type
  * @{
  */
#define DMC_SDRAM_REFRESH_TYPE_ROW_ONE          (0x00000000U)
#define DMC_SDRAM_REFRESH_TYPE_ROW_ALL          (0x00000001U)
/**
  * @}
  */

/** @defgroup DMC_SDRAM_Mode_Status DMC SDRAM Mode Status
  * @{
  */
#define DMC_SDRAM_NORMAL_MODE                   (0x00000000U)
#define DMC_SDRAM_SELF_REFRESH_MODE             (0x00000001U)
#define DMC_SDRAM_POWER_DOWN_MODE               (0x00000002U)
/**
  * @}
  */

/**
  * @}
  */

#endif /* DMC */

/** @defgroup DMC_DDL_Interrupt_definition DMC Low Layer Interrupt definition
  * @{
  */

/** @defgroup DMC_Flag_definition DMC Flag definition
  * @{
  */
#define DMC_SDRAM_FLAG_SELF_REFRESH             ((uint32_t)DMC_CTRL1_SRMFLG)

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @defgroup DMC_DDL_Private_Macros DMC_DDL  Private Macros
  * @{
  */

#if defined(DMC)

/** @defgroup DMC_DDL_NOR_Macros DMC SDRAM Macros
  * @brief macros to handle SDRAM device switch operations
  * @{
  */

/**
  * @brief  Switch to the DMC Controller.
  * @param  __INSTANCE__ DMC_SDRAM Instance
  * @retval None
  */
#define __DMC_SDRAM_ENABLE(__INSTANCE__)            ((__INSTANCE__)->SW |= DMC_SW_MCSW)

/**
  * @brief  Switch to the SMC Controller.
  * @param  __INSTANCE__ DMC_SDRAM Instance
  * @retval None
  */
#define __DMC_SDRAM_DISABLE(__INSTANCE__)           ((__INSTANCE__)->SW &= ~DMC_SW_MCSW)

/**
  * @}
  */

/** @defgroup DMC_DDL_NOR_Macros DMC SDRAM Macros
  * @brief macros to handle SDRAM device control operations
  * @{
  */

/**
  * @brief  Update the SDRAM Mode Setup.
  * @param  __INSTANCE__ DMC_SDRAM Instance
  * @retval None
  */
#define __DMC_SDRAM_UPDATE_MODE_SETUP(__INSTANCE__)             ((__INSTANCE__)->CTRL1 |= DMC_CTRL1_MODESET)

/**
  * @brief  Enable SDRAM self-refresh mode.
  * @param  __INSTANCE__ DMC_SDRAM Instance
  * @retval None
  */
#define __DMC_SDRAM_SELF_REFRESH_MODE_ENABLE(__INSTANCE__)      ((__INSTANCE__)->CTRL1 |= DMC_CTRL1_SRMEN)

/**
  * @brief  Disable SDRAM self-refresh mode.
  * @param  __INSTANCE__ DMC_SDRAM Instance
  * @retval None
  */
#define __DMC_SDRAM_SELF_REFRESH_MODE_DISABLE(__INSTANCE__)     ((__INSTANCE__)->CTRL1 &= ~DMC_CTRL1_SRMEN)

/**
  * @brief  Enable SDRAM power down mode.
  * @param  __INSTANCE__ DMC_SDRAM Instance
  * @retval None
  */
#define __DMC_SDRAM_POWER_DOWN_MODE_ENABLE(__INSTANCE__)        ((__INSTANCE__)->CTRL1 |= DMC_CTRL1_PDMEN)

/**
  * @brief  Disable SDRAM power down mode.
  * @param  __INSTANCE__ DMC_SDRAM Instance
  * @retval None
  */
#define __DMC_SDRAM_POWER_DOWN_MODE_DISABLE(__INSTANCE__)       ((__INSTANCE__)->CTRL1 &= ~DMC_CTRL1_PDMEN)

/**
  * @}
  */

/** @defgroup DMC_DDL_SDRAM_Interrupt DMC SDRAM Interrupt
  * @brief macros to handle SDRAM interrupts
  * @{
  */

/**
  * @brief  Get flag status of the SDRAM device.
  * @param  __INSTANCE__ DMC_SDRAM instance
  * @param  __FLAG__     DMC_SDRAM flag
  *         This parameter can be any combination of the following values:
  *            @arg DMC_SDRAM_FLAG_SELF_REFRESH: Self-refresh mode flag.
  * @retval The state of FLAG (SET or RESET).
  */
#define __DMC_SDRAM_GET_FLAG(__INSTANCE__, __FLAG__)  (((__INSTANCE__)->CTRL1 & (__FLAG__)) == (__FLAG__))


/**
  * @}
  */
#endif /* DMC */
/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup DMC_DDL_Private_Functions DMC DDL Private Functions
  *  @{
  */

#if defined(DMC)
/** @defgroup DMC_DDL_SDRAM SDRAM
  *  @{
  */
/** @defgroup DMC_DDL_SDRAM_Private_Functions_Group1 SDRAM Initialization/de-initialization functions
  *  @{
  */
DAL_StatusTypeDef  DMC_SDRAM_Init(DMC_SDRAM_TypeDef *Device, DMC_SDRAM_InitTypeDef *Init);
DAL_StatusTypeDef  DMC_SDRAM_Timing_Init(DMC_SDRAM_TypeDef *Device,
                                         DMC_SDRAM_TimingTypeDef *Timing);
DAL_StatusTypeDef  DMC_SDRAM_DeInit(DMC_SDRAM_TypeDef *Device);
/**
  * @}
  */

/** @defgroup DMC_DDL_SDRAM_Private_Functions_Group2 SDRAM Control functions
  *  @{
  */
DAL_StatusTypeDef  DMC_SDRAM_ProgramRefreshPeriod(DMC_SDRAM_TypeDef *Device, uint32_t RefreshPeriod);
DAL_StatusTypeDef DMC_SDRAM_SetOpenBankNumber(DMC_SDRAM_TypeDef *Device, uint32_t OpenBankNumber);
uint32_t DMC_SDRAM_GetModeStatus(DMC_SDRAM_TypeDef *Device);
/**
  * @}
  */
/**
  * @}
  */
#endif /* DMC */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DDL_DMC_H */
